; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-52)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b5)
    (on b5 b9)
    (on b9 b13)
    (on b13 b11)
    (on b11 b1)
    (on b1 b2)
    (on b2 b14)
    (on b14 b12)
    (on b12 b4)
    (on b4 b15)
    (on b15 b10)
    (on b10 b6)
    (on-table b6)
    (clear b8)
    (on b8 b3)
    (on-table b3))
 (:goal (and 
(clear b7) (on b7 b3)
))
)

; plan
1. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 1 of 2
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 2
3. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 0 of 2
4. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 2 of 2
